# 1. Grouping and Aggregation

In [42]:
import pandas as pd

data = {
    'Employee': ['Alice', 'Bob', 'Alice', 'Bob', 'Charlie', 'Alice', 'Charlie', 'Bob'],
    'Region': ['North', 'South', 'North', 'South', 'North', 'South', 'North', 'North'],
    'Sales': [200, 150, 300, 400, 100, 250, 300, 350],
    'Year': [2023, 2023, 2024, 2024, 2023, 2024, 2024, 2023]
}

df = pd.DataFrame(data)

In [43]:
df.groupby('Employee')['Sales'].sum()

Employee
Alice      750
Bob        900
Charlie    400
Name: Sales, dtype: int64

In [44]:
df.groupby('Region')['Sales'].mean()

Region
North    250.000000
South    266.666667
Name: Sales, dtype: float64

In [45]:
df.groupby(['Employee', 'Year'])['Sales'].sum()

Employee  Year
Alice     2023    200
          2024    550
Bob       2023    500
          2024    400
Charlie   2023    100
          2024    300
Name: Sales, dtype: int64

# 2. Merging and Concatenation

In [46]:
employee_details = pd.DataFrame({
    'Employee': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'Department': ['Sales', 'Sales', 'Marketing', 'HR']
})

sales_targets = pd.DataFrame({
 'Employee': ['Alice', 'Bob', 'Charlie', 'David'],
    'Sales_Target': [1000, 1200, 800, 500]
})

In [47]:

merged_df= pd.merge(employee_details, sales_targets, on='Employee')
merged_df

  Employee  Age Department  Sales_Target
0    Alice   25      Sales          1000
1      Bob   30      Sales          1200
2  Charlie   35  Marketing           800
3    David   40         HR           500

In [48]:

total_sales = {
    'Alice': 750,
    'Bob': 900,
    'Charlie': 700
}

total_sales_df = pd.DataFrame(list(total_sales.items()), columns=['Employee', 'Total_Sales'])
merged_df= pd.merge(employee_details, sales_targets, on='Employee')

merged_df = pd.merge(merged_df, total_sales_df, on='Employee', how='left')

merged_df['Total_Sales'] = merged_df['Total_Sales'].fillna(0)

merged_df['Difference'] = merged_df['Sales_Target'] - merged_df['Total_Sales']

merged_df = merged_df[['Employee', 'Age', 'Department', 'Sales_Target', 'Total_Sales', 'Difference']]
merged_df

  Employee  Age Department  Sales_Target  Total_Sales  Difference
0    Alice   25      Sales          1000        750.0       250.0
1      Bob   30      Sales          1200        900.0       300.0
2  Charlie   35  Marketing           800        700.0       100.0
3    David   40         HR           500          0.0       500.0

# 3. Working with Time-Series Data

In [64]:
stock_prices = pd.DataFrame({
    'Date': ['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04', '2024-01-05'],
    'Price': [100, 102, 105, 107, 110]
})

In [68]:
stock_prices.reset_index(inplace=True)
stock_prices['Date'] = pd.to_datetime(stock_prices['Date'])
stock_prices.set_index('Date', inplace=True)
stock_prices

            Price
Date
2024-01-01    100
2024-01-02    102
2024-01-03    105
2024-01-04    107
2024-01-05    110

In [69]:
weekly_avg_prices = stock_prices.resample('W').mean()
print(weekly_avg_prices)

            Price
Date
2024-01-07  104.8

In [70]:
highest_price_day = stock_prices['Price'].idxmax()
print("Day with highest stock price:", highest_price_day)

Day with highest stock price: 2024-01-05 00:00:00

# 4. Pivot Tables and Cross-Tabulations

In [78]:
data = {
    'Employee': ['Alice', 'Bob', 'Alice', 'Bob', 'Charlie', 'Alice', 'Charlie', 'Bob'],
    'Region': ['North', 'South', 'North', 'South', 'North', 'South', 'North', 'North'],
    'Sales': [200, 150, 300, 400, 100, 250, 300, 350],
    'Year': [2023, 2023, 2024, 2024, 2023, 2024, 2024, 2023]
}

df = pd.DataFrame(data)

pivot_table = df.pivot_table(values='Sales', index='Region', columns='Year', aggfunc='sum', fill_value=0)
pivot_table

Year    2023  2024
Region
North    650   600
South    150   650

In [75]:
cross_tabulation = pd.crosstab(df['Region'], df['Year'], margins=True, margins_name='Total')
cross_tabulation

Year    2023  2024  Total
Region
North      3     2      5
South      1     2      3
Total      4     4      8

# 5. Exporting Data

In [76]:
merged_csv = merged_df.to_csv('employee_sales.csv', index=False)

In [80]:
pivot_table_excel = pivot_table.to_excel('sales_summary.xlsx', index=True)